results/synthetic/baselines/io_stream.fio-seqread.hogun-baseline-6.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=21900: Thu Jul  9 18:45:08 2015
  read : io=4096.0MB, bw=99105KB/s, iops=774, runt= 42322msec
    slat (usec): min=22, max=278, avg=71.64, stdev= 8.62
    clat (msec): min=4, max=162, avg=10.25, stdev= 2.67
     lat (msec): min=4, max=162, avg=10.32, stdev= 2.67
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   10], 10.00th=[   10], 20.00th=[   10],
     | 30.00th=[   10], 40.00th=[   10], 50.00th=[   10], 60.00th=[   10],
     | 70.00th=[   11], 80.00th=[   11], 90.00th=[   11], 95.00th=[   12],
     | 99.00th=[   13], 99.50th=[   15], 99.90th=[   28], 99.95th=[   48],
     | 99.99th=[  161]
    bw (KB  /s): min=64000, max=104960, per=100.00%, avg=99237.48, stdev=6018.72
    lat (msec) : 10=69.57%, 20=30.29%, 50=0.09%, 100=0.02%, 250=0.02%
  cpu          : usr=1.44%, sys=9.21%, ctx=33693, majf=0, minf=1607
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=99104KB/s, minb=99104KB/s, maxb=99104KB/s, mint=42322msec, maxt=42322msec

Disk stats (read/write):
  sda: ios=32657/17, merge=24/5, ticks=331476/340, in_queue=331804, util=99.92%