results/synthetic/baselines/io_stream.fio-seqread.michael-baseline-1.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=29102: Thu Jul  9 15:09:43 2015
  read : io=4096.0MB, bw=95701KB/s, iops=747, runt= 43827msec
    slat (usec): min=11, max=194, avg=21.66, stdev= 2.25
    clat (msec): min=6, max=89, avg=10.68, stdev= 2.35
     lat (msec): min=6, max=89, avg=10.70, stdev= 2.35
    clat percentiles (usec):
     |  1.00th=[ 9408],  5.00th=[ 9664], 10.00th=[10176], 20.00th=[10176],
     | 30.00th=[10304], 40.00th=[10304], 50.00th=[10560], 60.00th=[10560],
     | 70.00th=[10560], 80.00th=[10560], 90.00th=[10944], 95.00th=[10944],
     | 99.00th=[18304], 99.50th=[19840], 99.90th=[45824], 99.95th=[54016],
     | 99.99th=[88576]
    bw (KB  /s): min=75520, max=105216, per=100.00%, avg=95778.79, stdev=4562.37
    lat (msec) : 10=7.40%, 20=92.15%, 50=0.37%, 100=0.07%
  cpu          : usr=0.00%, sys=4.01%, ctx=32777, majf=0, minf=547
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=95701KB/s, minb=95701KB/s, maxb=95701KB/s, mint=43827msec, maxt=43827msec

Disk stats (read/write):
  sda: ios=32672/24, merge=36/10, ticks=346916/28952, in_queue=375908, util=99.90%