results/synthetic/baselines/io_stream.fio-seqread.michael-baseline-7.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 512MB)

file1: (groupid=0, jobs=1): err= 0: pid=23756: Wed Jul  8 10:10:03 2015
  read : io=524288KB, bw=80130KB/s, iops=626, runt=  6543msec
    slat (usec): min=19, max=153, avg=20.81, stdev= 3.81
    clat (usec): min=11037, max=22656, avg=12751.47, stdev=579.66
     lat (usec): min=11197, max=22678, avg=12772.58, stdev=580.41
    clat percentiles (usec):
     |  1.00th=[12352],  5.00th=[12352], 10.00th=[12352], 20.00th=[12480],
     | 30.00th=[12608], 40.00th=[12608], 50.00th=[12608], 60.00th=[12736],
     | 70.00th=[12864], 80.00th=[12992], 90.00th=[12992], 95.00th=[12992],
     | 99.00th=[13888], 99.50th=[15168], 99.90th=[21632], 99.95th=[21632],
     | 99.99th=[22656]
    bw (KB  /s): min=76800, max=81408, per=100.00%, avg=80216.15, stdev=1307.06
    lat (msec) : 20=99.71%, 50=0.29%
  cpu          : usr=0.00%, sys=2.69%, ctx=4099, majf=0, minf=283
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=4096/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=524288KB, aggrb=80129KB/s, minb=80129KB/s, maxb=80129KB/s, mint=6543msec, maxt=6543msec

Disk stats (read/write):
  sda: ios=3997/0, merge=0/1, ticks=50916/0, in_queue=51996, util=98.57%