results/synthetic/baselines/io_stream.fio-seqread.michael-baseline-9.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=29300: Thu Jul  9 15:20:15 2015
  read : io=4096.0MB, bw=148988KB/s, iops=1163, runt= 28152msec
    slat (usec): min=11, max=106, avg=21.42, stdev= 2.34
    clat (msec): min=4, max=59, avg= 6.85, stdev= 1.13
     lat (msec): min=4, max=59, avg= 6.87, stdev= 1.13
    clat percentiles (usec):
     |  1.00th=[ 6496],  5.00th=[ 6496], 10.00th=[ 6496], 20.00th=[ 6496],
     | 30.00th=[ 6880], 40.00th=[ 6880], 50.00th=[ 6880], 60.00th=[ 6880],
     | 70.00th=[ 6880], 80.00th=[ 6880], 90.00th=[ 6880], 95.00th=[ 6880],
     | 99.00th=[ 7776], 99.50th=[10560], 99.90th=[16768], 99.95th=[31872],
     | 99.99th=[58624]
    bw (KB  /s): min=126725, max=150784, per=100.00%, avg=149136.84, stdev=3658.90
    lat (msec) : 10=99.47%, 20=0.46%, 50=0.05%, 100=0.02%
  cpu          : usr=0.00%, sys=5.04%, ctx=32766, majf=0, minf=547
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=148987KB/s, minb=148987KB/s, maxb=148987KB/s, mint=28152msec, maxt=28152msec

Disk stats (read/write):
  sda: ios=32649/5, merge=24/7, ticks=222644/1992, in_queue=224636, util=99.96%