results/synthetic/baselines/io_stream.fio-seqread.shark-baseline-0.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=10854: Thu Jul  9 18:36:51 2015
  read : io=4096.0MB, bw=115111KB/s, iops=899, runt= 36437msec
    slat (usec): min=25, max=268, avg=63.44, stdev= 6.57
    clat (usec): min=4683, max=29704, avg=8822.15, stdev=727.69
     lat (usec): min=4747, max=29753, avg=8886.41, stdev=727.61
    clat percentiles (usec):
     |  1.00th=[ 7584],  5.00th=[ 7584], 10.00th=[ 8768], 20.00th=[ 8896],
     | 30.00th=[ 8896], 40.00th=[ 8896], 50.00th=[ 8896], 60.00th=[ 8896],
     | 70.00th=[ 8896], 80.00th=[ 8896], 90.00th=[ 8896], 95.00th=[ 8896],
     | 99.00th=[10688], 99.50th=[10688], 99.90th=[18816], 99.95th=[19072],
     | 99.99th=[27264]
    bw (KB  /s): min=108032, max=115968, per=100.00%, avg=115219.90, stdev=1103.61
    lat (msec) : 10=97.91%, 20=2.04%, 50=0.05%
  cpu          : usr=1.31%, sys=9.78%, ctx=33396, majf=0, minf=1342
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=115111KB/s, minb=115111KB/s, maxb=115111KB/s, mint=36437msec, maxt=36437msec

Disk stats (read/write):
  sda: ios=32566/4, merge=12/1, ticks=285476/64, in_queue=285464, util=99.85%