results/synthetic/baselines/io_stream.fio-seqread.shark-baseline-1.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=10878: Thu Jul  9 18:38:10 2015
  read : io=4096.0MB, bw=115105KB/s, iops=899, runt= 36439msec
    slat (usec): min=25, max=231, avg=63.47, stdev= 6.47
    clat (usec): min=4687, max=37691, avg=8822.54, stdev=814.87
     lat (usec): min=4753, max=37756, avg=8886.82, stdev=814.54
    clat percentiles (usec):
     |  1.00th=[ 7584],  5.00th=[ 7584], 10.00th=[ 8768], 20.00th=[ 8896],
     | 30.00th=[ 8896], 40.00th=[ 8896], 50.00th=[ 8896], 60.00th=[ 8896],
     | 70.00th=[ 8896], 80.00th=[ 8896], 90.00th=[ 8896], 95.00th=[ 8896],
     | 99.00th=[10688], 99.50th=[10688], 99.90th=[17280], 99.95th=[20864],
     | 99.99th=[36096]
    bw (KB  /s): min=109139, max=115968, per=100.00%, avg=115186.71, stdev=1142.99
    lat (msec) : 10=97.89%, 20=2.06%, 50=0.05%
  cpu          : usr=1.64%, sys=9.52%, ctx=33413, majf=0, minf=1872
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=115104KB/s, minb=115104KB/s, maxb=115104KB/s, mint=36439msec, maxt=36439msec

Disk stats (read/write):
  sda: ios=32668/4, merge=12/1, ticks=286208/76, in_queue=286200, util=99.85%