results/synthetic/baselines/io_stream.fio-seqread.shark-baseline-3.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=5992: Wed Jul  8 15:24:45 2015
  read : io=4096.0MB, bw=130282KB/s, iops=1017, runt= 32194msec
    slat (usec): min=24, max=287, avg=63.57, stdev= 6.67
    clat (msec): min=4, max=58, avg= 7.79, stdev= 1.17
     lat (msec): min=4, max=58, avg= 7.85, stdev= 1.17
    clat percentiles (usec):
     |  1.00th=[ 6624],  5.00th=[ 6624], 10.00th=[ 6624], 20.00th=[ 7904],
     | 30.00th=[ 7904], 40.00th=[ 7904], 50.00th=[ 7904], 60.00th=[ 7968],
     | 70.00th=[ 7968], 80.00th=[ 7968], 90.00th=[ 7968], 95.00th=[ 8032],
     | 99.00th=[ 9792], 99.50th=[ 9920], 99.90th=[22144], 99.95th=[40704],
     | 99.99th=[42752]
    bw (KB  /s): min=105772, max=132096, per=100.00%, avg=130395.72, stdev=3315.02
    lat (msec) : 10=99.64%, 20=0.26%, 50=0.10%, 100=0.01%
  cpu          : usr=1.80%, sys=10.65%, ctx=33436, majf=0, minf=812
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=130282KB/s, minb=130282KB/s, maxb=130282KB/s, mint=32194msec, maxt=32194msec

Disk stats (read/write):
  sda: ios=32629/3, merge=12/1, ticks=252008/108, in_queue=252072, util=99.81%