results/synthetic/baselines/io_stream.fio-seqread.shark-baseline-4.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=6014: Wed Jul  8 15:25:55 2015
  read : io=4096.0MB, bw=130351KB/s, iops=1018, runt= 32177msec
    slat (usec): min=24, max=253, avg=63.50, stdev= 6.64
    clat (msec): min=5, max=62, avg= 7.78, stdev= 1.09
     lat (msec): min=5, max=62, avg= 7.85, stdev= 1.09
    clat percentiles (usec):
     |  1.00th=[ 6624],  5.00th=[ 6624], 10.00th=[ 6624], 20.00th=[ 7904],
     | 30.00th=[ 7904], 40.00th=[ 7904], 50.00th=[ 7904], 60.00th=[ 7968],
     | 70.00th=[ 7968], 80.00th=[ 7968], 90.00th=[ 7968], 95.00th=[ 8032],
     | 99.00th=[ 9792], 99.50th=[ 9920], 99.90th=[19072], 99.95th=[27776],
     | 99.99th=[41216]
    bw (KB  /s): min=111872, max=132096, per=100.00%, avg=130459.03, stdev=2610.88
    lat (msec) : 10=99.65%, 20=0.26%, 50=0.08%, 100=0.01%
  cpu          : usr=1.78%, sys=10.65%, ctx=33413, majf=0, minf=1343
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=130350KB/s, minb=130350KB/s, maxb=130350KB/s, mint=32177msec, maxt=32177msec

Disk stats (read/write):
  sda: ios=32584/3, merge=12/1, ticks=251556/88, in_queue=251580, util=99.80%