results/synthetic/baselines/io_stream.fio-seqread.shark-baseline-8.out
file1: (g=0): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=8
fio-2.1.3
Starting 1 process
file1: Laying out IO file(s) (1 file(s) / 4096MB)

file1: (groupid=0, jobs=1): err= 0: pid=11040: Thu Jul  9 18:47:42 2015
  read : io=4096.0MB, bw=110176KB/s, iops=860, runt= 38069msec
    slat (usec): min=24, max=249, avg=64.59, stdev= 7.65
    clat (usec): min=4955, max=29848, avg=9219.39, stdev=708.65
     lat (usec): min=5020, max=29896, avg=9284.80, stdev=708.74
    clat percentiles (usec):
     |  1.00th=[ 7840],  5.00th=[ 9024], 10.00th=[ 9152], 20.00th=[ 9152],
     | 30.00th=[ 9152], 40.00th=[ 9152], 50.00th=[ 9152], 60.00th=[ 9280],
     | 70.00th=[ 9280], 80.00th=[ 9280], 90.00th=[ 9280], 95.00th=[ 9280],
     | 99.00th=[11072], 99.50th=[11200], 99.90th=[17536], 99.95th=[25984],
     | 99.99th=[28032]
    bw (KB  /s): min=102912, max=112128, per=100.00%, avg=110282.28, stdev=1463.23
    lat (msec) : 10=97.83%, 20=2.08%, 50=0.09%
  cpu          : usr=1.83%, sys=8.83%, ctx=33402, majf=0, minf=1342
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=110176KB/s, minb=110176KB/s, maxb=110176KB/s, mint=38069msec, maxt=38069msec

Disk stats (read/write):
  sda: ios=32718/4, merge=12/1, ticks=299796/64, in_queue=299808, util=99.87%